const MenAndWomen = {
  nameGroup: [
    'Пальто, полупальто зимние (с подкладкой и утепляющей прокладкой)',
    'Жакет зимний (с подкладкой и утепляющей прокладкой)',
    'Смокинг',
    'Пиджак без подкладки',
    'Фрак, визитка',
    'Пояс для фрачного костюма',
    'Жакет (с подкладкой)',
    'Жакет (без подкладки)',
    'Куртка (с подкладкой и утепляющей прокладкой)',
    'Куртка (с подкладкой)' ,
    'Куртка (без подкладки)',
    'Жилет (с подкладкой)',
    'Жилет без подкладки',
    'Жилет под пиджак, смокинг, фрак, визитку',
    'Жилет разных фасонов с подкладкой из натурального меха, без подбортов',
    'Жилет разных фасонов с подкладкой из искусственного меха, без подбортов',
    'Брюки мужские длинные и укороченные (длиной ниже коленей), с подкладкой под передние половинки и без подкладки',
    'Брюки женские длинные и укороченные (длиной ниже коленей), с подкладкой под передние половинки и без подкладки',
    'Брюки мужские и женские с утепляющей прокладкой и подкладкой',
    'Шорты мужские и женские разных фасонов с подкладкой и без подкладки',
    'Комбинезон без подкладки',
    'Полукомбинезон с бретелями и нагрудником',
    'Юбка без подкладки'
  ],
  
  complicatingElements: [
    'в плечевых изделиях (кроме комбинезона)',
    'в поясных изделиях (брюках, юбке, полукомбинезоне) и комбинезоне',
  ],

  data: {
    "1": [
      {id: Math.random(), value: 74}, 
      {id: Math.random(), value: 59}, 
      {id: Math.random(), value: 62}, 
      {id: Math.random(), value: 47}, 
      {id: Math.random(), value: 62},

      {id: Math.random(), value: 47},
      {id: Math.random(), value: 95},
      {id: Math.random(), value: 120},
      {id: Math.random(), value: 19},
      {id: Math.random(), value: 56},
      {id: Math.random(), value: 42},

      {id: Math.random(), value: 48},
      {id: Math.random(), value: 42},
      {id: Math.random(), value: 34},
      {id: Math.random(), value: 30},
      {id: Math.random(), value: 24},
      {id: Math.random(), value: 26},
      {id: Math.random(), value: 15},
      {id: Math.random(), value: 12},
      {id: Math.random(), value: 21},
      {id: Math.random(), value: 19},

      {id: Math.random(), value: 0},
      {id: Math.random(), value: 14},
      {id: Math.random(), value: 39},
      {id: Math.random(), value: 27},
      {id: Math.random(), value: 12},
    ],

    "2": [
      {id: Math.random(), value: 57}, 
      {id: Math.random(), value: 46}, 
      {id: Math.random(), value: 48}, 
      {id: Math.random(), value: 36}, 
      {id: Math.random(), value: 48},

      {id: Math.random(), value: 36},
      {id: Math.random(), value: 75},
      {id: Math.random(), value: 96},
      {id: Math.random(), value: 15},
      {id: Math.random(), value: 43},
      {id: Math.random(), value: 32},

      {id: Math.random(), value: 39},
      {id: Math.random(), value: 52},
      {id: Math.random(), value: 26},
      {id: Math.random(), value: 24},
      {id: Math.random(), value: 19},
      {id: Math.random(), value: 20},
      {id: Math.random(), value: 12},
      {id: Math.random(), value: 9},
      {id: Math.random(), value: 15},
      {id: Math.random(), value: 13},

      {id: Math.random(), value: 19},
      {id: Math.random(), value: 10},
      {id: Math.random(), value: 30},
      {id: Math.random(), value: 19},
      {id: Math.random(), value: 10}
    ],

    "3": [
      {id: Math.random(), value: 44}, 
      {id: Math.random(), value: 35}, 
      {id: Math.random(), value: 36}, 
      {id: Math.random(), value: 27}, 
      {id: Math.random(), value: 36},

      {id: Math.random(), value: 27},
      {id: Math.random(), value: 0},
      {id: Math.random(), value: 0},
      {id: Math.random(), value: 0},
      {id: Math.random(), value: 32},
      {id: Math.random(), value: 24},

      {id: Math.random(), value: 32},
      {id: Math.random(), value: 26},
      {id: Math.random(), value: 21},
      {id: Math.random(), value: 15},
      {id: Math.random(), value: 13},
      {id: Math.random(), value: 13},
      {id: Math.random(), value: 9},
      {id: Math.random(), value: 7},
      {id: Math.random(), value: 12},
      {id: Math.random(), value: 11},

      {id: Math.random(), value: 15},
      {id: Math.random(), value: 9},
      {id: Math.random(), value: 26},
      {id: Math.random(), value: 16},
      {id: Math.random(), value: 8},
    ],
    "4": [
      {id: Math.random(), value: 0}, 
      {id: Math.random(), value: 0}, 
      {id: Math.random(), value: 34}, 
      {id: Math.random(), value: 24}, 
      {id: Math.random(), value: 0},

      {id: Math.random(), value: 0},
      {id: Math.random(), value: 0},
      {id: Math.random(), value: 0},
      {id: Math.random(), value: 0},
      {id: Math.random(), value: 0},
      {id: Math.random(), value: 0},

      {id: Math.random(), value: 27},
      {id: Math.random(), value: 23},
      {id: Math.random(), value: 18},
      {id: Math.random(), value: 15},
      {id: Math.random(), value: 13},
      {id: Math.random(), value: 13},
      {id: Math.random(), value: 9},
      {id: Math.random(), value: 7},
      {id: Math.random(), value: 12},
      {id: Math.random(), value: 11},

      {id: Math.random(), value: 15},
      {id: Math.random(), value: 9},
      {id: Math.random(), value: 26},
      {id: Math.random(), value: 16},
      {id: Math.random(), value: 8},
    ],
  },

  dataCElements: {
    "1": [{id: Math.random(), value: 2.5}, {id: Math.random(), value: 2.3}],
    "2": [{id: Math.random(), value: 2}, {id: Math.random(), value: 1.8}],
    "3": [{id: Math.random(), value: 1.7}, {id: Math.random(), value: 1.5}],
    "4": [{id: Math.random(), value: 1.7}, {id: Math.random(), value: 1.5}],
  }
}

const Men = {
  nameGroup: [
    'Сорочка, блуза'
  ],
  complicatingElements: [],

  data: {
    "1": [{id: Math.random(), value: 8}],
    "2": [{id: Math.random(), value: 6}],
    "3": [{id: Math.random(), value: 5}],
    "4": [{id: Math.random(), value: 5}],
  },

  dataCElements: {
    "1": [{id: Math.random(), value: 1}],
    "2": [{id: Math.random(), value: 0.8}],
    "3": [{id: Math.random(), value: 0.6}],
    "4": [{id: Math.random(), value: 0.6}],
  }
}

const Women = {
  nameGroup: [
    'Платье, сарафан',
    'Халат',
    'Чехол разной длины под платье (шелк натуральный; вискоза подкладочная; хлопок, батист)',
    'Юбка нижняя разной длины',
    'Жакет, блузка'
  ],
  complicatingElements: [],

  data: {
    "1": [
      {id: Math.random(), value: 27}, 
      {id: Math.random(), value: 0}, 
      {id: Math.random(), value: 0}, 
      {id: Math.random(), value: 0}, 
      {id: Math.random(), value: 19}
    ],
    "2": [
      {id: Math.random(), value: 18}, 
      {id: Math.random(), value: 21}, 
      {id: Math.random(), value: 9, text: "Шелк натуральный"}, 
      {id: Math.random(), value: 5},
      {id: Math.random(), value: 15}
    ],
    "3": [
      {id: Math.random(), value: 16}, 
      {id: Math.random(), value: 18}, 
      {id: Math.random(), value: 7.5, text: "вискоза подкладочная"}, 
      {id: Math.random(), value: 4},
      {id: Math.random(), value: 13}
    ],
    "4": [
      {id: Math.random(), value: 14}, 
      {id: Math.random(), value: 16}, 
      {id: Math.random(), value: 7.5, text: "хлопок, батист"}, 
      {id: Math.random(), value: 4}, 
      {id: Math.random(), value: 11}
    ],
  },

  dataCElements: {
    "1": [{id: Math.random(), value: 2.2}],
    "2": [{id: Math.random(), value: 1.7}],
    "3": [{id: Math.random(), value: 1.4}],
    "4": [{id: Math.random(), value: 1.4}],
  }
}


const GeneralCElements = {

  titles: [ 
    'Рельефы, швы, складки, клинья, шлицы (разрезы)', 
    'Подрезы, драпировки, сборки, кулиса. Детали отрезные в горизонтальном направлении', 
    'Застёжка, лацканы, воротник, вырез горловины, капюшон', 
    'Карманы, клапаны',
    'Кокетка, вставка, планка, баска, пелерина, бретели и др. детали',
    'Пояс, хлястик, детали накладные мелкие',
    'Рукава',
    'Особенности обработки материалов',
    'Особенности конструирования и технологической обработки изделий',
  ],

  CElements: {
    "1": [
        {
            id: Math.random(), 
            value: 2.5, 
            title: 'Рельефы разрезные или неразрезные, прямые или переходящие в складки – не более двух'
        },
        {
            id: Math.random(), 
            value: 2.3,
            title: `Рельефы, или отрезные бочки, или швы в изделии.
                    два прерывающихся рельефа на одной полочке или другой детали`
        },
        {
            id: Math.random(), 
            value: 2.2,
            title: 'Отрезные бочки в изделии'
        },
        {
            id: Math.random(), 
            value: 1,
            title: 'Швы в изделии, включая швы клиньев – не более двух '
        },
        {
          id: Math.random(), 
          value: 2,
          title: 'Фигурные разрезные не более двух'
      },
      {
          id: Math.random(), 
          title: 'Вытачки по линии талии полочек и спинки. Сверх минимальной сложности', 
          value: 1
      }, 
      {
        id: Math.random(), 
        title: `
          Складки разных видов. 
          Заутюженные шириной свыше 2 см: 
          - длиной свыше 30 см – не более трёх 
          - длиной до 30 см – не более шести 
          - одна складка в изделии поперечная или расположенная в косом направлении `, 
        value: 1
      },
      {
        id: Math.random(), 
        title: 'Складки разных видов. Складки в боковых швах брюк', 
        value: 1
      },
      {
        id: Math.random(), 
        title: 'Складки разных видов. Мягкие (застрочены по линии соединения с другой деталью): не более шести, кроме юбки в складку', 
        value: 1.5
      },
      {
        id: Math.random(), 
        title: 'Складки мягкие по всей юбке (в том числе в юбке в отрезном изделии). Застрочены по линии соединения с другой деталью (не более двенадцати)', 
        value: 2
      },
      {
        id: Math.random(), 
        title: 'Клинья, втачанные в швы, рельефы. В юбке или отрезном по линии талии изделии не более двух клиньев', 
        value: 1
      },
      {
        id: Math.random(), 
        title: 'Шлицы (разрезы) в швах изделия. Одна шлица (разрез любой длины)', 
        value: 1
      },
      {
        id: Math.random(), 
        title: 'Шлицы (разрезы) в швах изделия. Две шлицы (разреза) любой длины до 15 см', 
        value: 1
      },
  
      {
        id: Math.random(), 
        title: 'Шлицы (разрезы) в швах изделия. Третий шов юбки и расположенная в нём шлица', 
        value: 1.5
      },
    ],
    "2": [
      {
        id: Math.random(), 
        value: 1.5, 
        title: 'Подрезы. Два подреза, симметрично расположенные, или один асимметрично расположенный подрез'
      },
      {
        id: Math.random(), 
        value: 2, 
        title: 'Подрезы. Два подреза, симметрично расположенные, или один асимметрично расположенный подрез со сборками или мягкими складками'
      },
      {
        id: Math.random(), 
        value: 1.5, 
        title: `
          Драпировка несложная.
          Достигается конструктивным способом с
          помощью сборок, мягких складок: по
          плечевым швам, переводному плечу
          изделий, середине переда, отрезной линии
          талии, бёдер, кокетки или на других участках
          полочек и спинки, половинок брюк, юбки
        `
      },
      {
        id: Math.random(), 
        value: 4, 
        title: `
          Драпировка сложная глубокая полочек (переда) или спинки. 
          Достигается частично конструктивным путём,
          а в основном муляжным методом – на фигуре
          заказчика`
      },
      {
        id: Math.random(), 
        value: 1, 
        title: `
          Кулиса на разных участках изделия.
          С лицевой или изнаночной стороны изделия,
          с продёргиванием узкой или широкой
          эластичной тесьмы или шнура в один ряд по
          линии талии или плечевым швам, или на
          других участках изделия (не более двух 1 участков)
        `
      },
      {
        id: Math.random(), 
        value: 1.5, 
        title: `
          Кулиса на разных участках изделия.
          С продёргиванием эластичной тесьмы или
          шнура в два ряда по линии талии или
          плечевым швам, или на других участках
          изделия (не более двух участков)
        `
      },
      {
        id: Math.random(), 
        value: 1, 
        title: `
          Тесьма эластичная, шнур по краям деталей.
          В один ряд по горловине
        `
      },
      {
        id: Math.random(), 
        value: 1, 
        title: `
          Тесьма эластичная, шнур по краям деталей. 
          В один ряд по верхнему краю юбки или по
          низу изделия или рукавов
        `
      },
      {
        id: Math.random(), 
        value: 1.5, 
        title: `
          Тесьма эластичная, шнур по краям деталей. 
          В два ряда по горловине, по верхнему краю
          юбки или по низу изделия или рукавов
        `
      },
      {
        id: Math.random(), 
        value: 1, 
        title: `
          Детали изделия, отрезные в горизонтальном направлении.
          Полочка и спинка по линии талии (отрезное
          по талии изделие), бёдер или на других
          участках, половинки брюк, переводное плечо
          изделия
        `
      },
      {
        id: Math.random(), 
        value: 1, 
        title: `
          Детали изделия, отрезные в горизонтальном направлении.
          Две отрезные линии только на полочках или
          только на спинке, или на одном полотнище
          юбки
        `
      }
    ],
    "3": [
      {
        id: Math.random(), 
        value: 1, 
        title: `
          Застёжка с обработкой её разными способами.
          На обмётанные петли и пуговицы, или
          пришивные кнопки, или пришивные крючки с
          петлями, или молнию (кроме
          предусмотренных в описании минимальной
          сложности):
          - в изделиях лёгкой одежды,
          юбке
          - в боковом шве плечевых
          изделий
          - в разрезах на разных участках изделия (не
          более двух)
          - на молнию (неразъемную) длиной свыше
          20 см,
        `
      },
      {
        id: Math.random(), 
        value: 1.5, 
        title: `
          Застёжка с обработкой её разными способами.
          - в мужской сорочке, блузе обработка планками или подбортами, или застёжка потайная
        `
      },
      {
        id: Math.random(), 
        value: 2, 
        title: `
          Застёжка с обработкой её разными способами.
          - в платье обработка планками или
          подбортами или застежка потайная
          - в среднем шве капюшона
        `
      },
      {
        id: Math.random(), 
        value: 2, 
        title: `
          Лацканы большие в верхней одежде. 
          Большими считаются лацканы шириной более 2 см от линии полузаноса.
          При расположении верхней петли выше линии груди.
        `
      },
      {
        id: Math.random(), 
        value: 3, 
        title: `
          Лацканы большие в верхней одежде.
          Большими считаются лацканы шириной более 2 см от линии полузаноса.
          При расположении верхней петли ниже линии груди и выше линии талии.
        `
      },
      {
        id: Math.random(), 
        value: 4, 
        title: `
          Лацканы большие в верхней одежде. 
          Большими считаются лацканы шириной более 2 см от линии полузаноса.
          При расположении верхней петли за стёжки на линии талии или ниже.
        `
      },
      {
        id: Math.random(), 
        value: 1, 
        title: `
          Воротник или вырез горловины.
          воротник притачной (стойка, отложой)
        `
      },
      {
        id: Math.random(), 
        value: 1.5, 
        title: `
          Воротник или вырез горловины.
          воротник притачной: отложной с отрезной стойкой или обтачкой по отлёту
        `
      },
      {
        id: Math.random(), 
        value: 2, 
        title: `
          Воротник или вырез горловины.
          воротник притачной: драпированный; с вытачками
        `
      },
      {
        id: Math.random(), 
        value: 2, 
        title: `
          Воротник или вырез горловины.
          притачной воротник - шарф; воротник – галстук; воротник матросский
        `
      },
      {
        id: Math.random(), 
        value: 1.5, 
        title: `
          Воротник или вырез горловины.
          воротник притачной: в лёгкой одежде апаш и
          шаль с орезным нижним воротником
          цельновыкроенным, с основными деталями
          изделия
        `
      },
      {
        id: Math.random(), 
        value: 1.5, 
        title: `
          Воротник или вырез горловины.
          притачной воротник широкий – в застёгнутом
          виде с расположением отлёта на расстоянии
          не более 2 см от линии проймы.
        `
      },
      {
        id: Math.random(), 
        value: 2, 
        title: `
          Воротник или вырез горловины.
          вырез горловины: большой или глубокий, или
          сложной конфигурации или вырез на спинке
          глубокий.
        `
      },
      {
        id: Math.random(), 
        value: 2, 
        title: `
          Воротник или вырез горловины.
          Воротник по типу «английский,
          однобортный, с шириной отлета до 7 см
        `
      },
      {
        id: Math.random(), 
        value: 3, 
        title: `
          Воротник или вырез горловины.
          Воротник по типу «английский, с шириной
          отлета более 7 см, постороенный путем
          совмещения полочки и спинки
        `
      },
      {
        id: Math.random(), 
        value: 1.5, 
        title: `
          Воротник или вырез горловины.
          большой вырез горловины – при длине
          плечевого шва до 5 см, глубокий – от линии
          обхвата груди первого и ниже 
        `
      },
      {
        id: Math.random(), 
        value: 2.5, 
        title: `
          Капюшон при наличии воротника.
          Притачной разной конструкции с подкладкой
        `
      },
      {
        id: Math.random(), 
        value: 2, 
        title: `
          Капюшон при наличии воротника.
          Притачной разной конструкции без подкладки
        `
      },
      {
        id: Math.random(), 
        value: 3, 
        title: `
          Капюшон при наличии воротника.
          Пристёгивающийся, с утепляющей
          прокладкой или на подкладке из
          искусственного меха
        `
      },
      {
        id: Math.random(), 
        value: 2.5, 
        title: `
          Капюшон при наличии воротника.
          Пристёгивающийся без подкладки
        `
      },
      {
        id: Math.random(), 
        value: 4, 
        title: `
          Капюшон (опушка) или
          воротник меховой,
          пристёгивающиеся к
          изделию (без
          скорняжных работ).
          Капюшон на подкладке и утепляющей
          прокладке, или на подкладке из
          искусственного меха 
        `
      },
      {
        id: Math.random(), 
        value: 3.5, 
        title: `
          Капюшон (опушка) или
          воротник меховой,
          пристёгивающиеся к
          изделию (без
          скорняжных работ).
          Капюшон или воротник без утепляющей подкладки
        `
      },
    ],
    "4": [
      {
        id: Math.random(), 
        value: 1, 
        title: `
          Карманы в швах или прорезные. В лёгкой
          одежде или  в верхней одежде - в верхней и
          лёгкой одежде – не более двух карманов в швах
        `
      },
      {
        id: Math.random(), 
        value: 1.2, 
        title: `
          Карманы в швах или прорезные. В лёгкой
          одежде или  в верхней одежде - в верхней и
          лёгкой одежде – не более двух карманов в швах с листочками
        `
      },
      {
        id: Math.random(), 
        value: 1.2, 
        title: `
          Карманы в швах или прорезные. В брюках, в швах передней половинки 
        `
      },
      {
        id: Math.random(), 
        value: 1.5, 
        title: `
          Карманы в швах или прорезные. В джинсах, в швах передней половинки 
        `
      },
      {
        id: Math.random(), 
        value: 2,
        title: `
          Карманы в швах или прорезные. В джинсах и джинсовой одежде, в швах передней
          половинки фигурные
        `
      },
      {
        id: Math.random(), 
        value: 1.5,
        title: `
          Карманы в швах или прорезные. В верхней и лёгкой одежде не
          более двух карманов прорезных в рамку
        `
      },
      {
        id: Math.random(), 
        value: 1.3,
        title: `
          Карманы в швах или прорезные. В верхней и лёгкой одежде не
          более двух карманов прорезных с листочками
        `
      },
      {
        id: Math.random(), 
        value: 1.7,
        title: `
          Карманы в швах или прорезные. В верхней и лёгкой одежде не
          более двух карманов прорезных с клапанами
        `
      },
      {
        id: Math.random(), 
        value: 1.8,
        title: `
          Карманы в швах или прорезные. В верхней и лёгкой одежде не
          более двух карманов прорезных с застёжкой на
          молнию
        `
      },
      {
        id: Math.random(), 
        value: 2,
        title: `
          Карманы в швах или прорезные. В верхней и лёгкой одежде не
          более двух карманов прорезных с клапаном и в
          рамку одновременно
        `
      },
      {
        id: Math.random(), 
        value: 1,
        title: `
          Карманы накладные. В верхней и лёгкой
          одежде – не более двух карманов: с прямым верхним краем
        `
      },
      {
        id: Math.random(), 
        value: 1.3,
        title: `
          Карманы накладные. В верхней и лёгкой
          одежде – не более двух карманов: с фигурным верхним краем
        `
      },
      {
        id: Math.random(), 
        value: 1.2,
        title: `
          Карманы накладные. В верхней и лёгкой
          одежде – не более двух карманов: с планкой по верхнему краю
        `
      },
      {
        id: Math.random(), 
        value: 1,
        title: `
          Карманы накладные. В верхней и лёгкой
          одежде – не более двух карманов: вместо карманов – имитация
          накладных карманов путём выполнения фигурных рельефов 
        `
      },
      {
        id: Math.random(), 
        value: 1.5,
        title: `
          Карманы накладные. В верхней и лёгкой одежде не более двух
          карманов, карман: с хлястиками, клапанами
        `
      },
      {
        id: Math.random(), 
        value: 1.7,
        title: `
          Карманы накладные. В верхней и лёгкой одежде не более двух
          карманов, карман: с бейками, застёжкой 
        `
      },
      {
        id: Math.random(), 
        value: 2,
        title: `
          Карманы накладные. В верхней и лёгкой одежде не более двух
          карманов, карман: с защипами, складками, драпировкой
        `
      },
      {
        id: Math.random(), 
        value: 1.8,
        title: `
          Карманы накладные. В верхней и лёгкой одежде не более двух
          карманов, карман: с обработкой прорези в рамку или с клапанами
        `
      },
      {
        id: Math.random(), 
        value: 1,
        title: `Карманы внутренние в подкладке, без отделки 1`
      },
      {
        id: Math.random(), 
        value: 1,
        title: `
          Клапаны отделочные с обмётанными на спецмашине петлями и
          пуговицами или без них, не более 2
        `
      },
      {
        id: Math.random(), 
        value: 1.5,
        title: `
          Клапаны отделочные фигурные, со сложными краями
        `
      },
      
    ],
    "5": [
      {
        id: Math.random(), 
        value: 1, 
        title: `
          Кокетка простая притачная на полочках и спинке;
        `
      },
      {
        id: Math.random(), 
        value: 1.5, 
        title: `
          Кокетка простая фигурная или полуотлетная на полочках или спинке
        `
      },
      {
        id: Math.random(), 
        value: 2, 
        title: `
          Кокетка сложная притачная на полочке, спинке и
          одновременно идущая по рукавам
        `
      },
      {
        id: Math.random(), 
        value: 2.5, 
        title: `
          Кокетка сложная отлетная (типа пелерины) на полочках и
          спинке
        `
      },
      {
        id: Math.random(), 
        value: 1, 
        title: `
          Кокетка сложная в мужской сорочке, блузе кокетка прямая на
          переде
        `
      },
      {
        id: Math.random(), 
        value: 1.5, 
        title: `
          Кокетка сложная двойная или фигурная на переде и спинке
        `
      },
      {
        id: Math.random(), 
        value: 1, 
        title: `
          Вставка
        `
      },
      {
        id: Math.random(), 
        value: 1.2, 
        title: `
          Планка по борту полочек в легкой одежде
        `
      },
      {
        id: Math.random(), 
        value: 1.8, 
        title: `
          Планка по борту полочек в верхней одежде
        `
      },
      {
        id: Math.random(), 
        value: 2, 
        title: `
          Баска с подкладкой
        `
      },
      {
        id: Math.random(), 
        value: 1.5, 
        title: `
          Баска без подкладки
        `
      },
      {
        id: Math.random(), 
        value: 2, 
        title: `
          Баска фигурная
        `
      },
      {
        id: Math.random(), 
        value: 2, 
        title: `
          Пелерина притачная
        `
      },
      {
        id: Math.random(), 
        value: 4, 
        title: `
          Пелерина съёмная С подкладкой
        `
      },
      {
        id: Math.random(), 
        value: 3, 
        title: `
          Пелерина съёмная Без подкладки
        `
      },
      {
        id: Math.random(), 
        value: 4, 
        title: `
          Палантин или тюник к
          изделию, или
          дополнительный слой
          юбки
        `
      },
      {
        id: Math.random(), 
        value: 1, 
        title: `
          Бретели С разными вариантами застёгивания – в
          юбке, брюках
        `
      },
      {
        id: Math.random(), 
        value: 2, 
        title: `
          Полочки и спинка в
          полукомбинезоне,
          нагрудник с бретелями
          в юбке
          С разными вариантами крепления бретелей
        `
      },
      {
        id: Math.random(), 
        value: 1.5, 
        title: `
          Спинка разных
          фасонов в
          полукомбинезоне
        `
      },
      {
        id: Math.random(), 
        value: 2, 
        title: `
          Полотнище юбки
          отлетное
          Втачанное в боковой шов или пояс
        `
      },
    ],
    "6": [
      {
        id: Math.random(), 
        value: 1.5, 
        title: `
          Пояс съёмный завязывающийся (кроме отделочного)
        `
      },
      {
        id: Math.random(), 
        value: 1, 
        title: `
          Пояс на мягкой прокладке или без неё, со
          шлёвками или воздушными нитяными
          петлями для удерживания или без них, с
          разными вариантами застёгивания
        `
      },
      {
        id: Math.random(), 
        value: 1.5, 
        title: `
          Пояс на жесткой прокладке (дублерин) с разными
          вариантами застёгивания
        `
      },
      {
        id: Math.random(), 
        value: 1, 
        title: `
          Пояс втачной на полочках и спинке
        `
      },
      {
        id: Math.random(), 
        value: 1, 
        title: `
          Пояс притачной или цельнокроеный широкий
          (свыше 7 см) – в юбке, брюках
        `
      },
      {
        id: Math.random(), 
        value: 1.5, 
        title: `
          Пояс притачной по низу
          изделия в легкой одежде прямой
        `
      },
      {
        id: Math.random(), 
        value: 2, 
        title: `
          Пояс притачной по низу
          изделия в легкой одежде фигурный 
        `
      },
      {
        id: Math.random(), 
        value: 2.5, 
        title: `
          Пояс притачной по низу изделия в
          верхней одежде прямой
        `
      },
      {
        id: Math.random(), 
        value: 3, 
        title: `
          Пояс притачной по низу изделия в
          верхней одежде фигурный
        `
      },
      {
        id: Math.random(), 
        value: 1, 
        title: `
          Пояс - кулиска Пояс, продёрнутый через кулису с лицевой
          или изнаночной стороны изделия
        `
      },
      {
        id: Math.random(), 
        value: 1, 
        title: `
          Хлястик Разных фасонов: - на спинке
        `
      },
      {
        id: Math.random(), 
        value: 2, 
        title: `
          Хлястик Разных фасонов: - на разных участках изделия,
          застёгивающийся на пряжку
        `
      },
      {
        id: Math.random(), 
        value: 1.5, 
        title: `
          Хлястик Разных фасонов: хлястик для регулирования
          прилегания брюк по линии
          талии (неболее двух)
        `
      },
      {
        id: Math.random(), 
        value: 2, 
        title: `
          Хлястик Разных фасонов: фигурный
        `
      },
      {
        id: Math.random(), 
        value: 0.6, 
        title: `
          Детали накладные мелкие
          шлевки пояса брюк (не боле шести)
        `
      },
      {
        id: Math.random(), 
        value: 1, 
        title: `
          Детали накладные мелкие
          паты, шлёвки обтачные, (не более четырёх)
          расположенные между двумя срезами
        `
      },
      {
        id: Math.random(), 
        value: 1, 
        title: `
          Детали накладные мелкие
          паты, шлёвки, погоны вытачные (не более
          двух) расположенные в одном срезе
        `
      },
      {
        id: Math.random(), 
        value: 1.5, 
        title: `
          Детали накладные мелкие
          Паты, шлёвки, погоны вытачные фигурные (не
          более двух) расположенные в одном срезе
        `
      },
    ],
    "7": [
      {
        id: Math.random(), 
        value: 1, 
        title: `
          Рукава короткие цельновыкроенные без ластовиц разной
          ширины в изделиях лёгкой одежды
          Длина рукавов от уровня подмышечной
          впадины до линии локтя
        `
      },
      {
        id: Math.random(), 
        value: 2, 
        title: `
          Рукава разных покроев
          в изделиях лёгкой
          одежды
          Рукава разной длины втачные, полуреглан,
          реглан, цельновыкроенные с ластовицей,
          длинные (ниже линии локтя
          цельновыкроеннные без ластовиц). Верхняя
          часть рукава гладкая. Низ рукавов гладкий
          или с одной вытачкой, складкой на каждом
          рукаве, или с отворотом, или с кулиской с
          продёрнутым готовым шнуром, эластичной
          тесьмой в один ряд. Гладкий низ рукавов
          обработан различными способами: швом в
          подгибку, двойной застрочкой на
          стачивающей машине, зигзагообразной
          строчкой, окантован.
        `
      },
      {
        id: Math.random(), 
        value: 2, 
        title: `
          Рукава сложные в
          мужской сорочке
          Покроя реглан или комбинированного, или
          цельнокроеные, без манжет
        `
      },
      {
        id: Math.random(), 
        value: 1, 
        title: `
          Особенности фасонов
          рукавов в изделиях
          верхней и лёгкой одежды
          Наполнение в верхней части рукава за счёт
          сборок, мягких складок, вытачек
        `
      },
      {
        id: Math.random(), 
        value: 2, 
        title: `
          Особенности фасонов
          рукавов в изделиях
          верхней и лёгкой одежды
          Наполнение в верхней части рукава большого объема за счёт сборок, мягких складок,
          вытачек
        `
      },
      {
        id: Math.random(), 
        value: 1, 
        title: `
          Особенности фасонов
          рукавов в изделиях
          верхней и лёгкой одежды
          Расклешённые – ширина по низу превышает
          ширину под проймой более 5 см
        `
      },
      {
        id: Math.random(), 
        value: 1.5, 
        title: `
          Особенности фасонов
          рукавов в изделиях
          верхней и лёгкой одежды
          Отрезные в горизонтальном направлении –
          без сборок, мягких складок по линии
          соединения деталей
        `
      },
      {
        id: Math.random(), 
        value: 2, 
        title: `
          Особенности фасонов
          рукавов в изделиях
          верхней и лёгкой одежды
          Дополнительный слой рукавов любой длины
        `
      },
      {
        id: Math.random(), 
        value: 1, 
        title: `
          Особенности фасонов
          рукавов в изделиях
          верхней и лёгкой одежды
          Кулиса с изнаночной или лицевой стороны
          рукавов, с продёргиванием тесьмы
          эластичной, шнура в один ряд (по верхним
          швам цельновыкроенных рукавов или по
          ширине рукавов
        `
      },
      {
        id: Math.random(), 
        value: 1, 
        title: `
          Особенности фасонов
          рукавов в изделиях
          верхней и лёгкой одежды
          Вставка – ластовица во втачных рукавах
        `
      },
      {
        id: Math.random(), 
        value: 1.5, 
        title: `
          Рукава с разными видами оформления низа
          В изделиях верхней и лёгкой одежды: - с вытачками, складками или
          сборками по низу рукавов без
          манжет
        `
      },
      {
        id: Math.random(), 
        value: 2, 
        title: `
          Рукава с разными видами оформления низа
          В изделиях верхней и лёгкой одежды: 
          - с манжетами (включая
            сборки, мягкие складки,
            обработку разрезов рукавов,
            по две петли с пуговицами на
            каждой манжете), или
            полуманжетами, или планкой
            – обтачкой
        `
      },
      {
        id: Math.random(), 
        value: 1.5, 
        title: `
          Рукава с разными видами оформления низа
          В изделиях верхней и лёгкой одежды: 
          С выпуклыми рельефами – по
          форме манжет, полуманжет и
          др. форм
        `
      },
      {
        id: Math.random(), 
        value: 1.5, 
        title: `
          Рукава с разными видами оформления низа
          В изделиях верхней и лёгкой одежды: 
          - с прокладыванием тесьмы
          эластичной, шнура в два – три ряда
        `
      },
      {
        id: Math.random(), 
        value: 1, 
        title: `
          Рукава с разными видами оформления низа
          В изделиях верхней и лёгкой одежды: 
          В изделиях лёгкой одежды,
          куртке, комбинезоне с
          разрезами (шлица ми)
        `
      },
      {
        id: Math.random(), 
        value: 1.5, 
        title: `
          Рукава с разными видами оформления низа
          В изделиях верхней и лёгкой одежды: 
          В изделиях лёгкой одежды,
          куртке, комбинезоне с
          разрезами (шлица ми) с
          застежной на молнию до 20
          см, на выметанных петлях с
          пуговицами не более двух, на
          пришивных крючках и петлях
          или пришивных кнопках
        `
      },
      {
        id: Math.random(), 
        value: 2, 
        title: `
          Рукава
          заплиссированные или
          загофрированные (без
          изготовления плиссе и
          гофре)
          За расклешение дополнительная плата не
          взимается
        `
      },
      {
        id: Math.random(), 
        value: 1.5, 
        title: `
          Пройма квадратная,
          фигурная, глубокая
          или настрочная
        `
      },
    ],
    "8": [
      {
        id: Math.random(), 
        value: 1, 
        title: `
          Подгонка рисунка Не более 2 деталей 1
        `
      },
      {
        id: Math.random(), 
        value: 2, 
        title: `
          Обработка изделий
          лёгкой одежды из
          пальтовой ткани
        `
      },
      {
        id: Math.random(), 
        value: 1, 
        title: `
          Обработка изделия с
          деталями из замши,
          кожи, меха, трикотажа
          и других разнородных
          по структуре изделия
          материалов Не более
          трёх деталей считаются по одной детали
        `
      },
      {
        id: Math.random(), 
        value: 2, 
        title: `
          Обработка изделия с
          деталями из замши,
          кожи, меха, трикотажа
          и других разнородных
          по структуре изделия
          материалов Не более
          трёх деталей парные детали: рукава,
          лацканы, части полочек спинки
        `
      },
      {
        id: Math.random(), 
        value: 1.5, 
        title: `
          Обработка изделия с
          деталями из замши,
          кожи, меха, трикотажа
          и других разнородных
          по структуре изделия
          материалов Не более
          трёх деталей трикотажные манжеты и
          притачной пояс по низу
          изделия
        `
      },
      {
        id: Math.random(), 
        value: 2, 
        title: `
        Обработка изделия из
        трикотажного полотна
        Умеренно растяжимого без уплотнений 
        `
      },
      {
        id: Math.random(), 
        value: 4, 
        title: `
        Обработка изделия из
        трикотажного полотна
        Сильнорастяжимого, «масло», ворсового
        `
      },
      {
        id: Math.random(), 
        value: 4, 
        title: `
          Обработка изделий с
          заплиссированными
          или
          загофрированными
          деталями или из
          Юбка или цельновыкроенное платье без
          рукавов, или перед и спинка отрезные по
          линии талии, или баска. За расклешение
          дополнительная плата не берётся
          гофрированной ткани
        `
      },
    ],
    "9": [
      {
        id: Math.random(), 
        value: 2, 
        title: `
          Силуэт и узлы изделия
          сложные
          Варианты форм, созданные соединением
          срезов сложных криволинейных
          конфигураций или требующие сложных
          приёмов влажно-тепловой обработки (за
          единицу)
        `
      },
      {
        id: Math.random(), 
        value: 4, 
        title: `
          Силуэт и узлы изделия
          сложные
          Варианты расширенных книзу форм (от
          плеча, уровня груди, талии, бёдер), изделие с
          фалдами и т.д.  
        `
      },
      {
        id: Math.random(), 
        value: 2, 
        title: `
          Изделие
          расклешённое
          К расклешённым относятся изделия,
          превышающие расклешение,
          предусмотренное минимальной сложностью
        `
      },
      {
        id: Math.random(), 
        value: 3, 
        title: `
          Юбка покроя клёш -
          полусолнце (в том
          числе в отрезном
          изделии), юбка -
          брюки
        `
      },
      {
        id: Math.random(), 
        value: 4, 
        title: `
          Юбка покроя клёш -
          солнце (в том числе в
          отрезном изделии),
          юбка - брюки
        `
      },
      {
        id: Math.random(), 
        value: 2, 
        title: `
          Брюки разных покроев Галифе, бриджи, «бананы» и др. Широкие –
          шириной свыше 30 см
        `
      },
      {
        id: Math.random(), 
        value: 3, 
        title: `
          Брюки разных покроев с отрезными манжетами (со сборками,
          мягкими складками по низу, с двумя петлями
          и пуговицами на каждой манжете)
        `
      },
      {
        id: Math.random(), 
        value: 2, 
        title: `
          Детали изделия
          основные
          раскроенные в косом
          направлении
          Полочки или спинка, или рукава (кроме
          рукавов «крылышки»), или юбка, или части
          основных деталей (любое количество)
        `
      },
      {
        id: Math.random(), 
        value: 1, 
        title: `
          Накладки плечевые верхние
          Разных форм – в изделиях легкой одежды
        `
      },
      {
        id: Math.random(), 
        value: 2, 
        title: `
          Накладки плечевые верхние
          В изделиях верхней одежды с подокатниками
        `
      },
      {
        id: Math.random(), 
        value: 2, 
        title: `
          Низ изделия сложный Обработанный обтачкой 
          с прокладыванием тесьмы
          эластичной в два – три ряда,
        `
      },
      {
        id: Math.random(), 
        value: 1, 
        title: `
          Низ изделия сложный Обработанный обтачкой 
          окантовочным швом (на спецмашине)
        `
      },
      {
        id: Math.random(), 
        value: 1.5, 
        title: `
          Низ изделия сложный Обработанн
          ый швом в
          подгибку
          расклешённый низ,
          обработанный на спецмашине
          зигзагообразной строчки
        `
      },
      {
        id: Math.random(), 
        value: 0.3, // 1/3 
        title: `
          Низ изделия сложный Обработанн
          ый швом в
          подгибку
          плавный скругленный,
          ассимметричный, (1/3 ???)
        `
      },
      {
        id: Math.random(), 
        value: 1,
        title: `
          Окантовка
          внутреннего края
          подбортов или
          подгибки низа
        `
      },
      {
        id: Math.random(), 
        value: 1.5,
        title: `
          Обработка срезов в
          мужской сорочке
          запошивочным швом
        `
      },
      {
        id: Math.random(), 
        value: 2,
        title: `
          Дублирование деталей
          клеевыми прокладками
          Частей полочек и спинки
          полочек (в верхней одежде
          только при наличии бортовой
          прокладки)
        `
      },
      {
        id: Math.random(), 
        value: 1,
        title: `
          Дублирование деталей
          клеевыми прокладками
          Частей полочек и спинки
          Спинка 
        `
      },
      {
        id: Math.random(), 
        value: 1,
        title: `
          Дублирование деталей
          клеевыми прокладками
          Частей полочек и спинки
          Рукава
        `
      },
      {
        id: Math.random(), 
        value: 2,
        title: `
          Детали изделия на
          подкладке В лёгкой
          одежде и комбинезоне
          - полочки
        `
      },
      {
        id: Math.random(), 
        value: 1,
        title: `
          Детали изделия на
          подкладке В лёгкой
          одежде и комбинезоне
          - спинка
        `
      },
      {
        id: Math.random(), 
        value: 1,
        title: `
          Детали изделия на
          подкладке В лёгкой
          одежде и комбинезоне
          - рукава
        `
      },
      {
        id: Math.random(), 
        value: 2,
        title: `
          Подкладка в юбке,
          жакете блузке без
          рукавов
        `
      },
      {
        id: Math.random(), 
        value: 3,
        title: `
          Подкладка в платье и
          комбинезоне без
          рукавов
        `
      },
      {
        id: Math.random(), 
        value: 4,
        title: `
          Подкладка в жакете,
          жакете с рукавами
          саржа без
          утеплителя
          крепление по борту, горловине
          по низу рукава и по низу изделия
        `
      },
      {
        id: Math.random(), 
        value: 5,
        title: `
          Подкладка из
          натурального меха
          (без скорняжных
          работ) или из
          искусственного меха
          крепление по борту, горловине по низу
          рукава и по низу изделия
        `
      },
      {
        id: Math.random(), 
        value: 1.5,
        title: `
          Прокладка
          утепляющая на
          полочки и спинку до
          линии талии, бёдер в
          демисезонном пальто
          крепление к подкладке по горловине, краю
          борта и пройме
        `
      },
      {
        id: Math.random(), 
        value: 2,
        title: `
          Прокладка
          утепляющая на
          полочки и спинку до
          линии низа в
          демисезонном пальто
          или в комбинезоне с
          рукавами
          крепление к подкладке по горловине, краю
          борта, низу рукава и по низу подкладки
        `
      },
      {
        id: Math.random(), 
        value: 2,
        title: `
          Прокладка
          утепляющая на
          полочки и
          спинку халата,
          жакета, или в юбку,
          или в рукава стёганых
          изделий
        `
      },
      {
        id: Math.random(), 
        value: 1.25,
        title: `
          Отделочная строчка
          одинарная по всем
          деталям изделия
          одинарная
          в жакете,
          блузоне,
          платье
          Гарусом (нитками для
          отделочных строчек), в 2 нитки
        `
      },
      {
        id: Math.random(), 
        value: 2.5,
        title: `
          Отделочная
          строчка двойная по всем
          деталям изделия
          в жакете,
          блузоне,
          платье
          Гарусом (нитками для
          отделочных строчек), в 2 нитки
        `
      },
      {
        id: Math.random(), 
        value: 3.75,
        title: `
          Отделочная
          строчка тройная по всем
          деталям изделия
          в жакете,
          блузоне,
          платье
          Гарусом (нитками для
          отделочных строчек), в 2 нитки
        `
      },
      {
        id: Math.random(), 
        value: 0.8,
        title: `
          Отделочная строчка
          одинарная по всем
          деталям изделия
          в юбке,
          брюках
          шортах
          Гарусом (нитками для
          отделочных строчек), в 2 нитки
        `
      },
      {
        id: Math.random(), 
        value: 1.5,
        title: `
          Отделочная строчка
          двойная по всем
          деталям изделия
          в юбке,
          брюках
          шортах
          Гарусом (нитками для
          отделочных строчек), в 2 нитки
        `
      },
      {
        id: Math.random(), 
        value: 2,
        title: `
          Отделочная строчка
          тройная по всем деталям
          изделия
          в юбке,
          брюках
          шортах
          Гарусом (нитками для
          отделочных строчек), в 2 нитки
        `
      },
      {
        id: Math.random(), 
        value: 1,
        title: `
          Отделочная строчка
          вышивальная по всем
          деталям изделия
          в жакете,
          блузоне,
          платье
          за 1м
        `
      },
      {
        id: Math.random(), 
        value: 2,
        title: `
          Отделочная строчка
          вышивальная по всем
          деталям изделия
          в жакете,
          блузоне,
          платье
          люрекс
        `
      },
      {
        id: Math.random(), 
        value: 1.5,
        title: `
          Отделочная строчка
          вышивальная
          двухигольная по всем
          деталям изделия
          в жакете,
          блузоне,
          платье
          за 1м
        `
      },
      {
        id: Math.random(), 
        value: 2,
        title: `
          Отделочная строчка в жакете,
          блузоне,
          платье
          люрекс
        `
      },
      {
        id: Math.random(), 
        value: 3,
        title: `
          Отделочная строчка
          вышивальная по всем
          деталям изделия
          в жакете,
          блузоне,
          платье
          люрекс за 1м
        `
      },
      {
        id: Math.random(), 
        value: 3,
        title: `
          Отделочная строчка
          вышивальная по всем
          деталям изделия
          в жакете,
          блузоне,
          платье
          люрекс за 1м
        `
      },
    ],
  }
}


const DifficultyGroups = [
  `Шелковый бархат (на шелковой и хлопчатобумажной основе),
  вельвет синтетический;
  ткани со сплошным застилом бисером, пайетками
  другие материалы, аналогичные по трудоемкости обработки.`,

  `Натуральные: кожа, замша;
  парча и шерстяные, шелковые материалы, с содержанием
  металлических нитей;
  шелковые: кружевные полотна, дорогой гипюр, шитье, шифон,
  шелк, батист, маркизет
  ворсовые пальтовые ткани, мохеры;
  хлопчатобумажный бархат;
  другие материалы, аналогичные по трудоемкости обработки.`,

  `Шерстяные костюмные ткани, в том числе с содержанием
  синтетических волокон (костюмно-плательной группы, а так же
  пальтовые);
  искусственный мех;
  тонкие дорогие трикотажные полотна;
  искусственные: кожа, замша;
  плащевые ткани (кроме синтетических тканей с пленочным
  покрытием типа «болонья»);
  эластичные материалы,
  стеганые полотна;
  шерстяные и шелковые нетканые текстильные материалы;
  хлопчатобумажные: кружевные полотна, гипюр, шитье, вельвет,
  габардин, джинсовая ткань, кирза и ткани с содержанием
  металлических нитей;
  другие материалы, аналогичные по трудоемкости обработки.`,

  `Хлопчатобумажные и льняные: пальтовые, костюмные ткани и
  нетканые текстильные материалы;
  дублированные материалы;
  хлопчатобумажные ткани: типа батиста, маркизета, махровая
  ткань; синтетические ткани с пленочным покрытием типа
  «Болонья»;
  другие материалы, аналогичные по трудоемкости обработки.`,
 
  `Хлопчатобумажные и льняные: плательные, сорочечные и
  корсетные ткани и нетканые текстильные материалы; другие
  материалы, аналогичные по трудоемкости обработки.`
]

export {
  DifficultyGroups,
  GeneralCElements,
  MenAndWomen,
  Men,
  Women,
}